src/cf/Catalogs/АвтоподстановкиДляОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>АвтоподстановкиДляОбъектов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Выражение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипОбъекта</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/ТипыОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыОбъектов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Файлы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Проекты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроектныеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пользователи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаименованияОписанияЗадач</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Мероприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗадачиПроцессов</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументыПредприятия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДействиеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Задача</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/АвтоподстановкиДляОбъектов/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Перем ОбновитьДанныеОбъектаВАдреснойКниге;
Перем ОбновитьСловаПоискаПоОбъектуВАдреснойКниге;
Перем ОбновитьДанныеОтображенияОбъектаВАдреснойКниге;
Перем ОбновитьДоступностьВПоискеПоОбъекту;

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Если ОбщегоНазначенияДокументооборот.ЭтоЗагрузкаИзУзлаРИБ(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если МиграцияПриложенийПереопределяемый.ЭтоЗагрузка(ЭтотОбъект) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЭтоГруппа Тогда
		ТекущаяДатаСеанса = ТекущаяДатаСеанса();
		Если ЭтоНовый() Или Не ЗначениеЗаполнено(ДатаСоздания) Тогда
			ДатаСоздания = ТекущаяДатаСеанса;
		КонецЕсли;
		ДатаИзменения = ТекущаяДатаСеанса;
	КонецЕсли;
	
	// Обновление адресной книги.
	ДополнительныеСвойства.Вставить(
		"ПараметрыОбновленияАдреснойКниги",
		Справочники.АвтоподстановкиДляОбъектов.ЗначенияПараметровОбновленияАдреснойКнигиПоОбъекту(ЭтотОбъект));
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Обновление адресной книги.
	Справочники.АвтоподстановкиДляОбъектов.ОбновитьАдреснуюКнигу(
		ЭтотОбъект, ДополнительныеСвойства.ПараметрыОбновленияАдреснойКниги);
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	Если ЭтоГруппа Тогда
		Возврат;
	КонецЕсли;
	
	Если ТипОбъекта = Перечисления.ТипыОбъектов.ЗадачиПроцессов Тогда
		ВызватьИсключение НСтр("ru = 'Невозможно скопировать автоподстановку с типом объекта ""Задачи процессов"".'");
	КонецЕсли;
	
	ДатаСоздания = Дата("00000000");
	ДатаИзменения = Дата("00000000");
	
КонецПроцедуры

#КонецОбласти

#Иначе
ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли
